saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.Kinetis_SDK_DFP.2.3.0.pdsc
    <condition id="Kinetis SYS_Power">
      <description>NXP Kinetis System Power dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LLWU"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PMC"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="RCM"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SMC"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="GPIO"/>
    </condition>

    <condition id="Kinetis OSA_BM">
      <description>NXP Kinetis OSA Bare Metal dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="LPTMR"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Interrupt"/>
    </condition>

    <condition id="Kinetis_K64F12 Utility_DebugConsole">
      <description>NXP Kinetis K64F12 Utility Debug Console dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK OSA"    Csub="OSA"/>
      <!-- K64F12 specifics -->
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="UART"/>
    </condition>
    <condition id="Kinetis Utility_Misc">
      <description>NXP Kinetis K64F12 Utility Misc dependency</description>
      <require condition="Kinetis"/>
      <require Cclass="Device" Cgroup="KSDK Utility" Csub="Debug Console"/>
    </condition>

    <condition id="Kinetis TWR-K64F120M">
      <description>NXP Kinetis FRDM-K64F dependency</description>
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK HAL"     Csub="MCG"/>
      <require Cclass="Device" Cgroup="KSDK HAL"     Csub="PORT"/>
      <require Cclass="Device" Cgroup="KSDK HAL"     Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK System"  Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK Utility" Csub="Debug Console"/>
      <require Cclass="Device" Cgroup="KSDK Driver"  Csub="GPIO"/>
    </condition>
    <condition id="Kinetis TWR-K64F120M BSP">
      <description>NXP Kinetis FRDM-K64F BSP dependency</description>
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK Configuration" Csub="TWR-K64F120M"/>
    </condition>
    <condition id="Kinetis TWR-K64F120M BSP I2C">
      <description>NXP Kinetis FRDM-K64F BSP with CMSIS I2C Driver dependency</description>
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK Configuration" Csub="TWR-K64F120M"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>
    
    <condition id="Kinetis FRDM-K64F">
      <description>NXP Kinetis FRDM-K64F dependency</description>
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK HAL"     Csub="MCG"/>
      <require Cclass="Device" Cgroup="KSDK HAL"     Csub="PORT"/>
      <require Cclass="Device" Cgroup="KSDK HAL"     Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK System"  Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK Utility" Csub="Debug Console"/>
      <require Cclass="Device" Cgroup="KSDK Driver"  Csub="GPIO"/>
    </condition>
    <condition id="Kinetis FRDM-K64F BSP">
      <description>NXP Kinetis FRDM-K64F BSP dependency</description>
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK Configuration" Csub="FRDM-K64F"/>
    </condition>
    <condition id="Kinetis FRDM-K64F BSP I2C">
      <description>NXP Kinetis FRDM-K64F BSP with CMSIS I2C Driver dependency</description>
      <require condition="K64F12"/>
      <require Cclass="Device" Cgroup="KSDK Configuration" Csub="FRDM-K64F"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C"/>
    </condition>

    <condition id="Kinetis_K64F CMSIS_Driver ETH_MAC">
      <description>NXP Kinetis K64F CMSIS ETH_MAC Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="ENET"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="OSC"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SIM"/>
    </condition>
    <condition id="Kinetis_K64F CMSIS_Driver I2C">
      <description>NXP Kinetis K64F CMSIS I2C Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="I2C"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="GPIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PORT"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis_K64F CMSIS_Driver SPI">
      <description>NXP Kinetis K64F CMSIS SPI Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="DSPI"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="GPIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PORT"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
    </condition>
    <condition id="Kinetis_K64F CMSIS_Driver USART">
      <description>NXP Kinetis K64F CMSIS USART Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="UART"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
    <condition id="Kinetis_K64F CMSIS_Driver SAI">
      <description>NXP Kinetis K64F CMSIS SAI Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SAI"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="eDMA"/>
    </condition>
