saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.Kinetis_SDK_DFP.2.3.0.pdsc
    <condition id="Kinetis_K64F CMSIS_Driver MCI">
      <description>NXP Kinetis K64F CMSIS MCI Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="GPIO"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="PORT"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SIM"/>
      <require Cclass="Device" Cgroup="KSDK HAL"    Csub="SDHC"/>
      <require Cclass="Device" Cgroup="KSDK System" Csub="Clock"/>
    </condition>
    <condition id="Kinetis_K64F CMSIS_Driver USB">
      <description>NXP Kinetis K64F CMSIS USB Driver dependency</description>
      <require condition="Kinetis_K64F"/>
      <accept Cclass="CMSIS" Cgroup="RTOS"/>
      <accept Cclass="CMSIS" Cgroup="RTOS2"/>
      <require Cclass="Device" Cgroup="KSDK Driver" Csub="GPIO"/>
    </condition>
  </conditions>

  <taxonomy>
    <description Cclass="Device" Cgroup="KSDK HAL">Kinetis SDK Hardware Abstraction Layer (HAL)</description>
    <description Cclass="Device" Cgroup="KSDK Driver">Kinetis SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="KSDK System">Kinetis SDK System Drivers</description>
    <description Cclass="Device" Cgroup="KSDK OSA" doc="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__os__abstraction.html">Kinetis SDK OS Abstraction Layer (OSA)</description>
    <description Cclass="Device" Cgroup="KSDK Utility">Kinetis SDK Utilities</description>
    <description Cclass="Board Support" Cgroup="Drivers">Kinetis BSP Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="KSDK Configuration" exclusive="1">
      <description>Kinetis SDK Framework Configuration</description>
      <files>
        <file category="doc" name="doc/Getting Started with Kinetis SDK (KSDK) v.1.2.pdf"/>
      </files>
    </api>
  </apis>
  <boards>  
    <board name="FRDM-K64F" vendor="NXP" revision="Rev. A" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="MK64FN1M0VLL12"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="MK64FX512xxx12"/>
      <image small="addon_mdk/Boards/NXP/FRDM-K64F/Documents/FRDM-K64F_small.png"
             large="addon_mdk/Boards/NXP/FRDM-K64F/Documents/FRDM-K64F_large.png"/>
      <description>
        The FRDM-K64F is a development board for the Kinetis K24, K63 and K64 120 MHz 32-bit ARM® Cortex™-M4 MCUs.
        It features the Kinetis MK64FN1M0VMD12 low-power MCU with 1MB Flash, 256 KB SRAM, USB USB and Ethernet MAC.
      </description>
      <book category="overview"  name="http://www.nxp.com/products/software-and-tools/hardware-development-tools/freedom-development-boards/freedom-development-platform-for-kinetis-k64-k63-and-k24-mcus:FRDM-K64F" title="FRDM-K64F Web Page"/>
      <book category="setup"     name="addon_mdk/Boards/NXP/FRDM-K64F/Documents/FRDMK64QSG.pdf" title="Quick Start Guide"/>
      <book category="schematic" name="addon_mdk/Boards/NXP/FRDM-K64F/Documents/FRDM-K64F_SCH.pdf" title="FRDM-K64F Schematics"/>
      <book category="manual"    name="addon_mdk/Boards/NXP/FRDM-K64F/Documents/FRDMK64FUG.pdf" title="User Manual"/>
      <feature type="ODbg"          n="1"              name="Onboard open-standard serial and debug adaptor (OpenSDA)"/>
      <feature type="PWR"           n="5"              name="USB Powered"/>
      <feature type="MemCard"       n="1"              name="Micro SD Card holder"/>
      <feature type="USB"           n="1"              name="Micro-AB USB connector"/>
      <feature type="USB"           n="1"              name="OpenSDAv2 Micro USB connector"/>
      <feature type="ETH"           n="1"              name="10/100 Ethernet Port"/>
      <feature type="Button"        n="3"/>
      <feature type="Accelerometer" n="1"              name="NXP FXOS8700CQ low-power, six-axis Xtrinsic sensor"/>
      <feature type="DIO"           n="8"              name="nRF24L01+ Nordic 2.4G Radio module expansion pins"/>
      <feature type="DIO"           n="4"              name="JY-MCU BT board V1.05 BT module expansion pins"/>
      <feature type="DIO"           n="33"             name="Digital IOs"/>
      <feature type="AIO"           n="9"              name="Analog IOs"/>
      <feature type="LED"           n="1"              name="RGB LED"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="SDA 10 pin Cortex debug (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- Freedom FRDM-K64F Development Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="addon_mdk/Boards/NXP/FRDM-K64F/Blinky">
      <description>CMSIS-RTOS Blinky example</description>
      <board name="FRDM-K64F" vendor="NXP"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="USB Device HID" doc="Abstract.txt" folder="addon_mdk/Boards/NXP/FRDM-K64F/Middleware/USB/Device/HID" version="1.0.0">
      <description>USB Human Interface Device providing access from PC to board LEDs and push buttons.</description>
      <board name="FRDM-K64F" vendor="NXP"/>
      <project>
        <environment name="uv" load="HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>HID</keyword>
      </attributes>
    </example>

    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="addon_mdk/Boards/NXP/FRDM-K64F/Middleware/USB/Device/MassStorage" version="1.0.0">
      <description>USB Mass Storage Device using SD/MMC Memory Card or RAM as storage media</description>
      <board name="FRDM-K64F" vendor="NXP"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>

    <example name="USB Host Mass Storage" doc="Abstract.txt" folder="addon_mdk/Boards/NXP/FRDM-K64F/Middleware/USB/Host/MassStorage" version="1.0.0">
      <description>USB Host file manipulation example: create, read, copy, delete files from USB Mass Storage Device and format storage device</description>
      <board name="FRDM-K64F" vendor="NXP"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>

    <example name="USB Host Keyboard" doc="Abstract.txt" folder="addon_mdk/Boards/NXP/FRDM-K64F/Middleware/USB/Host/Keyboard" version="1.0.0">
      <description>Measure example using USB HID Keyboard as input device</description>
      <board name="FRDM-K64F" vendor="NXP"/>
      <project>
        <environment name="uv" load="Keyboard.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Keyboard</keyword>
      </attributes>
    </example>

