saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.Kinetis_SDK_DFP.2.3.0.pdsc
        <!-- device configurations required by drivers at the moment -->
        <file category="header" name="addon_cmsis/Driver/MK64F/Config/RTE_Device.h" attr="config" version="1.1.0" condition="K64F12"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.8" condition="Kinetis_GCC">
      <description>System Startup for NXP Kinetis Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_KINETIS      /* Device Startup for Kinetis Series */
      </RTE_Components_h>
      <files>
        <!-- include folders -->
        <file category="include" name="platform/devices/"/>

        <!-- startup files -->
        <file category="source" name="platform/devices/startup.c"/>
        <file category="source" name="platform/devices/MK64F12/startup/gcc/startup_MK64F12.S" attr="config" version="2.8" condition="K64F12"/>

        <!-- system files -->
        <file category="header" name="platform/devices/MK64F12/startup/system_MK64F12.h" attr="config" version="2.8" condition="K64F12"/>
        <file category="source" name="platform/devices/MK64F12/startup/system_MK64F12.c" attr="config" version="2.8" condition="K64F12"/>

        <!-- linker scripts -->
    <!--<file category="linkerScript" name="platform/devices/MK64F12/linker/gcc/MK64FX512xxx12_flash.ld"  attr="config" version="2.8" condition="K64FX512">/-->
    <!--<file category="linkerScript" name="platform/devices/MK64F12/linker/gcc/MK64FX512xxx12_ram.ld"    attr="config" version="2.8" condition="K64FX512">/-->
        <file category="linkerScript" name="platform/devices/MK64F12/linker/gcc/MK64FN1M0xxx12_flash.ld"  attr="config" version="2.8" condition="K64FN1M0"/>
        <file category="linkerScript" name="platform/devices/MK64F12/linker/gcc/MK64FN1M0xxx12_ram.ld"    attr="config" version="2.8" condition="K64FN1M0"/>
        </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cversion="2.8" condition="Kinetis_IAR">
      <description>System Startup for NXP Kinetis Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_KINETIS      /* Device Startup for Kinetis Series */
      </RTE_Components_h>
      <files>
        <!-- include folders -->
        <file category="include" name="platform/devices/"/>

        <!-- startup files -->
        <file category="source" name="platform/devices/startup.c"/>
        <file category="source" name="platform/devices/MK64F12/startup/iar/startup_MK64F12.s" attr="config" version="2.8" condition="K64F12"/>

        <!-- system files -->
        <file category="header" name="platform/devices/MK64F12/startup/system_MK64F12.h" attr="config" version="2.8" condition="K64F12"/>
        <file category="source" name="platform/devices/MK64F12/startup/system_MK64F12.c" attr="config" version="2.8" condition="K64F12"/>

        <!-- linker scripts -->
    <!--<file category="linkerScript" name="platform/devices/MK64F12/linker/iar/MK64FX512xxx12_flash.icf" attr="config" version="2.8" condition="K64FX512">/-->
    <!--<file category="linkerScript" name="platform/devices/MK64F12/linker/iar/MK64FX512xxx12_ram.icf"   attr="config" version="2.8" condition="K64FX512">/-->
        <file category="linkerScript" name="platform/devices/MK64F12/linker/iar/MK64FN1M0xxx12_flash.icf" attr="config" version="2.8" condition="K64FN1M0"/>
        <file category="linkerScript" name="platform/devices/MK64F12/linker/iar/MK64FN1M0xxx12_ram.icf"   attr="config" version="2.8" condition="K64FN1M0"/>
        </files>
    </component>

    <!-- KSDK Configuration -->
    <component Cclass="Device" Cgroup="KSDK Configuration" Csub="FRDM-K64F" Capiversion="1.0" Cversion="1.2.0" condition="Kinetis FRDM-K64F">
      <description>Configuration for NXP FRDM-K64F Development Board</description>
      <RTE_Components_h>
        #define RTE_DEVICE_CONFIGURATION_FRDM_K64F
      </RTE_Components_h>
      <files>
        <file category="doc"    name="addon_mdk/Boards/NXP/FRDM-K64F/Documents/FRDM-K64F_SDK_BSP.pdf"/>
        <file category="header" name="examples/frdmk64f/board.h"/>
        <file category="source" name="examples/frdmk64f/board.c"/>
        <file category="source" name="examples/frdmk64f/hardware_init.c" attr="config"/>
        <file category="source" name="examples/frdmk64f/gpio_pins.c"/>
        <file category="source" name="examples/frdmk64f/pin_mux.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="KSDK Configuration" Csub="TWR-K64F120M" Capiversion="1.0" Cversion="1.2.0" condition="Kinetis TWR-K64F120M">
      <description>Configuration for NXP TWR-K64F120M Development Board</description>
      <RTE_Components_h>
        #define RTE_DEVICE_CONFIGURATION_TWR_K64F120M
      </RTE_Components_h>
      <files>
        <!--<file category="doc"    name="addon_mdk/Documents/FRDM-K64F_SDK_BSP.pdf"/>-->
        <file category="header" name="examples/twrk64f120m/board.h"/>
        <file category="source" name="examples/twrk64f120m/board.c"/>
        <file category="source" name="examples/twrk64f120m/hardware_init.c" attr="config"/>
        <file category="source" name="examples/twrk64f120m/gpio_pins.c"/>
        <file category="source" name="examples/twrk64f120m/pin_mux.c"/>
      </files>
    </component>

    <!-- KSDK HAL -->
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="ADC16" Cversion="1.2.0" condition="Kinetis">
      <description>16-bit SAR Analog-to-digital converter (ADC16)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ADC16
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__adc16__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_adc16_hal.h"/>
        <file category="source" name="platform/hal/src/adc16/fsl_adc16_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="AOI" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Crossbar AND/OR/INVERT (AOI) Module</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_AOI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__aoi__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_aoi_hal.h"/>
        <file category="source" name="platform/hal/src/aoi/fsl_aoi_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="CADC" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>12-bit Cyclic Analog-to-Digital Converter (CADC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CADC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__cadc__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_cadc_hal.h"/>
        <file category="source" name="platform/hal/src/cyclicAdc/fsl_cadc_hal.c"/>
      </files>
    </component>
