saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.Kinetis_SDK_DFP.2.3.0.pdsc
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="CMP" Cversion="1.2.0" condition="Kinetis">
      <description>Comparator (CMP)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CMP
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__cmp__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_cmp_hal.h"/>
        <file category="source" name="platform/hal/src/cmp/fsl_cmp_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="COP" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Computer Operating Properly (COP) Watchdog Timer</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_COP
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__cop__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_cop_hal.h"/>
        <file category="source" name="platform/hal/src/cop/fsl_cop_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="CRC" Cversion="1.2.0" condition="Kinetis">
      <description>Cyclic Redundancy Check (CRC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_CRC
      </RTE_Components_h>
      <files>
    <!--<file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__crc__hal.html"/>-->
        <file category="header" name="platform/hal/inc/fsl_crc_hal.h"/>
        <file category="source" name="platform/hal/src/crc/fsl_crc_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="DAC" Cversion="1.2.0" condition="Kinetis">
      <description>Digital-to-Analog Converter (DAC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DAC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__dac__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_dac_hal.h"/>
        <file category="source" name="platform/hal/src/dac/fsl_dac_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="DMA" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Direct Memory Access (DMA)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__dma__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_dma_hal.h"/>
        <file category="source" name="platform/hal/src/dma/fsl_dma_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="DMAMUX" Cversion="1.2.0" condition="Kinetis">
      <description>Direct Memory Access Multiplexer (DMAMUX)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DMAMUX
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__dmamux__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_dmamux_hal.h"/>
        <file category="source" name="platform/hal/src/dmamux/fsl_dmamux_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="DSPI" Cversion="1.2.0" condition="Kinetis">
      <description>Serial Peripheral Interface (DSPI)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_DSPI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__dspi__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_dspi_hal.h"/>
        <file category="source" name="platform/hal/src/dspi/fsl_dspi_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="eDMA" Cversion="1.2.0" condition="Kinetis">
      <description>Enhanced Direct Memory Access (eDMA)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_EDMA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__edma__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_edma_hal.h"/>
        <file category="source" name="platform/hal/src/edma/fsl_edma_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="ENC" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>Quadrature Encoder/Decoder (ENC)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ENC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__enc__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_enc_hal.h"/>
        <file category="source" name="platform/hal/src/enc/fsl_enc_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="ENET" Cversion="1.2.0" condition="Kinetis">
      <description>Ethernet MAC (ENET)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_ENET
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__enet__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_enet_hal.h"/>
        <file category="source" name="platform/hal/src/enet/fsl_enet_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="EWM" Cversion="1.2.0" condition="Kinetis">
      <description>External Watchdog Timer (EWM)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_EWM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__ewm__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_ewm_hal.h"/>
        <file category="source" name="platform/hal/src/ewm/fsl_ewm_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="FLEXBUS" Cversion="1.2.0" condition="Kinetis Unknown">
      <description>External Bus Interface (FLEXBUS)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLEXBUS
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexbus__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_flexbus_hal.h"/>
        <file category="source" name="platform/hal/src/flexbus/fsl_flexbus_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK HAL" Csub="FlexCAN" Cversion="1.2.0" condition="Kinetis">
      <description>Controller Area Network (FlexCAN)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_FLEXCAN
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexcan__hal.html"/>
        <file category="header" name="platform/hal/inc/fsl_flexcan_hal.h"/>
        <file category="source" name="platform/hal/src/flexcan/fsl_flexcan_hal.c"/>
      </files>
    </component>
