saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.Kinetis_SDK_DFP.2.3.0.pdsc
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXIO_I2C" Cversion="1.2.0" condition="Kinetis DRV_FLEXIO_I2C">
      <description>FlexIO I2C (FLEXIO_I2C)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_I2C
      </RTE_Components_h>
      <files>
    <!--<file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexio__i2c__driver.html"/>-->
        <file category="header" name="platform/drivers/inc/fsl_flexio_i2c_master_driver.h"/>
        <file category="source" name="platform/drivers/src/flexio/fsl_flexio_i2c_master_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXIO_I2S" Cversion="1.2.0" condition="Kinetis DRV_FLEXIO_I2S">
      <description>FlexIO I2S (FLEXIO_I2S)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_I2S
      </RTE_Components_h>
      <files>
    <!--<file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexio__i2s__driver.html"/>-->
        <file category="header" name="platform/drivers/inc/fsl_flexio_i2s_driver.h"/>
        <file category="source" name="platform/drivers/src/flexio/fsl_flexio_i2s_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXIO_SPI" Cversion="1.2.0" condition="Kinetis DRV_FLEXIO_SPI">
      <description>FlexIO SPI (FLEXIO_SPI)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_SPI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexio__spi__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_flexio_spi_driver.h"/>
        <file category="source" name="platform/drivers/src/flexio/fsl_flexio_spi_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXIO_UART" Cvariant="IRQ" Cversion="1.2.0" condition="Kinetis DRV_FLEXIO_UART_IRQ">
      <description>FlexIO UART (FLEXIO_UART): Interrupt driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_UART_IRQ
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexio__uart__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_flexio_uart_driver.h"/>
        <file category="source" name="platform/drivers/src/flexio/fsl_flexio_uart_driver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="FLEXIO_UART" Cvariant="DMA" Cversion="1.2.0" condition="Kinetis DRV_FLEXIO_UART_DMA">
      <description>FlexIO UART (FLEXIO_UART): DMA driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FLEXIO_UART_DMA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__flexio__uart__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_flexio_uart_dma_driver.h"  condition="Kinetis Unknown"/>
        <file category="header" name="platform/drivers/inc/fsl_flexio_uart_edma_driver.h" condition="Kinetis Unknown"/>
        <file category="source" name="platform/drivers/src/flexio/fsl_flexio_uart_dma_driver.c"  condition="Kinetis Unknown"/>
        <file category="source" name="platform/drivers/src/flexio/fsl_flexio_uart_edma_driver.c" condition="Kinetis Unknown"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="FTM" Cversion="1.2.0" condition="Kinetis DRV_FTM">
      <description>FlexTimer (FTM)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_FTM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__ftm__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_ftm_driver.h"/>
        <file category="source" name="platform/drivers/src/ftm/fsl_ftm_driver.c"/>
        <file category="source" name="platform/drivers/src/ftm/fsl_ftm_common.c"/>
        <file category="source" name="platform/drivers/src/ftm/fsl_ftm_irq.c"/>
        <file category="source" name="platform/drivers/src/ftm/fsl_ftm_lpm_callback.c" attr="template" select="FTM LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="GPIO" Cversion="1.2.0" condition="Kinetis DRV_GPIO">
      <description>General Purpose Input/Output (GPIO)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_GPIO
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__gpio__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_gpio_driver.h"/>
        <file category="source" name="platform/drivers/src/gpio/fsl_gpio_driver.c"/>
        <file category="source" name="platform/drivers/src/gpio/fsl_gpio_common.c"/>
        <file category="source" name="platform/drivers/src/gpio/fsl_gpio_irq.c" attr="template" select="GPIO IRQ"/>
        <file category="source" name="platform/drivers/src/gpio/fsl_gpio_lpm_callback.c" attr="template" select="GPIO LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="I2C" Cversion="1.2.0" condition="Kinetis DRV_I2C">
      <description>Inter-Integrated Circuit (I2C)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_I2C
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__i2c.html"/>
        <file category="header" name="platform/drivers/inc/fsl_i2c_master_driver.h"/>
        <file category="header" name="platform/drivers/inc/fsl_i2c_slave_driver.h"/>
        <file category="source" name="platform/drivers/src/i2c/fsl_i2c_common.c"/>
        <file category="source" name="platform/drivers/src/i2c/fsl_i2c_master_driver.c"/>
        <file category="source" name="platform/drivers/src/i2c/fsl_i2c_slave_driver.c"/>
        <file category="source" name="platform/drivers/src/i2c/fsl_i2c_shared_function.c"/>
        <file category="source" name="platform/drivers/src/i2c/fsl_i2c_irq.c"/>
        <file category="source" name="platform/drivers/src/i2c/fsl_i2c_lpm_callback.c" attr="template" select="I2C LPM"/>
      </files>
    </component>
