saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.Kinetis_SDK_DFP.2.3.0.pdsc
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="LMEM" Cversion="1.2.0" condition="Kinetis DRV_LMEM">
      <description>Local Memory Controller (LMEM) Cache</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LMEM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__local__memory__controller__cache__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_lmem_cache_driver.h"/>
        <file category="source" name="platform/drivers/src/lmem/fsl_lmem_cache_driver.c"/>
        <file category="source" name="platform/drivers/src/lmem/fsl_lmem_common.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="LPSCI" Cvariant="IRQ" Cversion="1.2.0" condition="Kinetis DRV_LPSCI_IRQ">
      <description>Low Power Serial Communication Interface (LPSCI): Interrupt driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPSCI_IRQ
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__lpsci__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_lpsci_driver.h"/>
        <file category="source" name="platform/drivers/src/lpsci/fsl_lpsci_driver.c"/>
        <file category="source" name="platform/drivers/src/lpsci/fsl_lpsci_common.c"/>
        <file category="source" name="platform/drivers/src/lpsci/fsl_lpsci_irq.c"/>
        <file category="source" name="platform/drivers/src/lpsci/fsl_lpsci_lpm_callback.c" attr="template" select="LPSCI LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="LPSCI" Cvariant="DMA" Cversion="1.2.0" condition="Kinetis DRV_LPSCI_DMA">
      <description>Low Power Serial Communication Interface (LPSCI): DMA driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPSCI_DMA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__lpsci__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_lpsci_dma_driver.h"/>
        <file category="source" name="platform/drivers/src/lpsci/fsl_lpsci_dma_driver.c"/>
        <file category="source" name="platform/drivers/src/lpsci/fsl_lpsci_common.c"/>
        <file category="source" name="platform/drivers/src/lpsci/fsl_lpsci_irq.c"/>
        <file category="source" name="platform/drivers/src/lpsci/fsl_lpsci_lpm_callback.c" attr="template" select="LPSCI LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="LPTMR" Cversion="1.2.0" condition="Kinetis DRV_LPTMR">
      <description>Low Power Timer (LPTMR)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPTMR
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__lptmr__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_lptmr_driver.h"/>
        <file category="source" name="platform/drivers/src/lptmr/fsl_lptmr_driver.c"/>
        <file category="source" name="platform/drivers/src/lptmr/fsl_lptmr_common.c"/>
        <file category="source" name="platform/drivers/src/lptmr/fsl_lptmr_irq.c"/>
        <file category="source" name="platform/drivers/src/lptmr/fsl_lptmr_lpm_callback.c" attr="template" select="LPTMR LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="LPUART" Cvariant="IRQ" Cversion="1.2.0" condition="Kinetis DRV_LPUART_IRQ">
      <description>Low Power Universal Asynchronous Receiver/Transmitter (LPUART): Interrupt driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPUART_IRQ
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__lpuart__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_lpuart_driver.h"/>
        <file category="source" name="platform/drivers/src/lpuart/fsl_lpuart_driver.c"/>
        <file category="source" name="platform/drivers/src/lpuart/fsl_lpuart_common.c"/>
        <file category="source" name="platform/drivers/src/lpuart/fsl_lpuart_irq.c"/>
        <file category="source" name="platform/drivers/src/lpuart/fsl_lpuart_lpm_callback.c" attr="template" select="LPUART LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="LPUART" Cvariant="DMA" Cversion="1.2.0" condition="Kinetis DRV_LPUART_DMA">
      <description>Low Power Universal Asynchronous Receiver/Transmitter (LPUART): DMA driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPUART_DMA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__lpuart__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_lpuart_dma_driver.h"  condition="Kinetis Unknown"/>
        <file category="header" name="platform/drivers/inc/fsl_lpuart_edma_driver.h" condition="Kinetis Unknown"/>
        <file category="source" name="platform/drivers/src/lpuart/fsl_lpuart_dma_driver.c"  condition="Kinetis Unknown"/>
        <file category="source" name="platform/drivers/src/lpuart/fsl_lpuart_edma_driver.c" condition="Kinetis Unknown"/>
        <file category="source" name="platform/drivers/src/lpuart/fsl_lpuart_common.c"/>
        <file category="source" name="platform/drivers/src/lpuart/fsl_lpuart_irq.c"/>
        <file category="source" name="platform/drivers/src/lpuart/fsl_lpuart_lpm_callback.c" attr="template" select="LPUART LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="MPU" Cversion="1.2.0" condition="Kinetis DRV_MPU">
      <description>Memory Protection Unit (MPU)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_MPU
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__mpu__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_mpu_driver.h"/>
        <file category="source" name="platform/drivers/src/mpu/fsl_mpu_driver.c"/>
        <file category="source" name="platform/drivers/src/mpu/fsl_mpu_common.c"/>
        <file category="source" name="platform/drivers/src/mpu/fsl_mpu_irq.c" attr="template" select="MPU IRQ"/>
        <file category="source" name="platform/drivers/src/mpu/fsl_mpu_lpm_callback.c" attr="template" select="MPU LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="PDB" Cversion="1.2.0" condition="Kinetis DRV_PDB">
      <description>Programmable Delay Block (PDB)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_PDB
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__pdb__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_pdb_driver.h"/>
        <file category="source" name="platform/drivers/src/pdb/fsl_pdb_driver.c"/>
        <file category="source" name="platform/drivers/src/pdb/fsl_pdb_common.c"/>
        <file category="source" name="platform/drivers/src/pdb/fsl_pdb_irq.c" attr="template" select="PDB IRQ"/>
        <file category="source" name="platform/drivers/src/pdb/fsl_pdb_lpm_callback.c" attr="template" select="PDB LPM"/>
      </files>
    </component>
