saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.Kinetis_SDK_DFP.2.3.0.pdsc
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="TSI" Cversion="1.2.0" condition="Kinetis DRV_TSI">
      <description>Touch Sense Input (TSI)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_TSI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__tsi__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_tsi_driver.h"/>
        <file category="source" name="platform/drivers/src/tsi/fsl_tsi_driver.c"/>
        <file category="source" name="platform/drivers/src/tsi/fsl_tsi_v2_driver_specific.c"/>
        <file category="source" name="platform/drivers/src/tsi/fsl_tsi_v4_driver_specific.c"/>
        <file category="source" name="platform/drivers/src/tsi/fsl_tsi_common.c"/>
        <file category="source" name="platform/drivers/src/tsi/fsl_tsi_irq.c"/>
        <file category="source" name="platform/drivers/src/tsi/fsl_tsi_lpm_callback.c" attr="template" select="TSI LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="UART" Cvariant="IRQ" Cversion="1.2.0" condition="Kinetis DRV_UART_IRQ">
      <description>Universal Asynchronous Receiver/Transmitter (UART): Interrupt driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_UART_IRQ
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__uart__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_uart_driver.h"/>
        <file category="source" name="platform/drivers/src/uart/fsl_uart_driver.c"/>
        <file category="source" name="platform/drivers/src/uart/fsl_uart_common.c"/>
        <file category="source" name="platform/drivers/src/uart/fsl_uart_irq.c"/>
        <file category="source" name="platform/drivers/src/uart/fsl_uart_lpm_callback.c" attr="template" select="UART LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="UART" Cvariant="DMA" Cversion="1.2.0" condition="Kinetis DRV_UART_DMA">
      <description>Universal Asynchronous Receiver/Transmitter (UART): DMA driven</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_UART_DMA
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__uart__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_uart_dma_driver.h"  condition="Kinetis Unknown"/>
        <file category="header" name="platform/drivers/inc/fsl_uart_edma_driver.h" condition="K64F12"/>
        <file category="source" name="platform/drivers/src/uart/fsl_uart_dma_driver.c"  condition="Kinetis Unknown"/>
        <file category="source" name="platform/drivers/src/uart/fsl_uart_edma_driver.c" condition="K64F12"/>
        <file category="source" name="platform/drivers/src/uart/fsl_uart_common.c"/>
        <file category="source" name="platform/drivers/src/uart/fsl_uart_lpm_callback.c" attr="template" select="UART LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="VREF" Cversion="1.2.0" condition="Kinetis DRV_VREF">
      <description>Reference (VREF)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_VREF
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__vref__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_vref_driver.h"/>
        <file category="source" name="platform/drivers/src/vref/fsl_vref_driver.c"/>
        <file category="source" name="platform/drivers/src/vref/fsl_vref_common.c"/>
        <file category="source" name="platform/drivers/src/vref/fsl_vref_lpm_callback.c" attr="template" select="VREF LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="WDOG" Cversion="1.2.0" condition="Kinetis DRV_WDOG">
      <description>Watchdog Timer (WDOG)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_WDOG
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__wdog__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_wdog_driver.h"/>
        <file category="source" name="platform/drivers/src/wdog/fsl_wdog_driver.c"/>
        <file category="source" name="platform/drivers/src/wdog/fsl_wdog_common.c"/>
        <file category="source" name="platform/drivers/src/wdog/fsl_wdog_irq.c" attr="template" select="WDOG IRQ"/>
        <file category="source" name="platform/drivers/src/wdog/fsl_wdog_lpm_callback.c" attr="template" select="WDOG LPM"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Driver" Csub="XBAR" Cversion="1.2.0" condition="Kinetis DRV_XBAR">
      <description>Inter-Peripheral Crossbar Switch (XBAR)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_XBAR
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__xbar__driver.html"/>
        <file category="header" name="platform/drivers/inc/fsl_xbar_driver.h"/>
        <file category="source" name="platform/drivers/src/xbar/fsl_xbar_driver.c"/>
        <file category="source" name="platform/drivers/src/xbar/fsl_xbar_common.c"/>
        <file category="source" name="platform/drivers/src/xbar/fsl_xbar_irq.c"/>
        <file category="source" name="platform/drivers/src/xbar/fsl_xbar_lpm_callback.c" attr="template" select="XBAR LPM"/>
      </files>
    </component>

    <!-- KSDK System -->
    <component Cclass="Device" Cgroup="KSDK System" Csub="Clock" Cversion="1.2.0" condition="Kinetis_K64F12 SYS_Clock">
      <description>Clock Manager (Clock)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SYSTEM_CLOCK
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__clock__manager.html"/>
        <file category="header" name="platform/system/inc/fsl_clock_manager.h"/>
        <file category="source" name="platform/system/src/clock/fsl_clock_manager.c"/>
        <file category="source" name="platform/system/src/clock/fsl_clock_manager_common.c"/>
        <file category="source" name="platform/system/src/clock/MK64F12/fsl_clock_MK64F12.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK System" Csub="Interrupt" Cversion="1.2.0" condition="Kinetis">
      <description>Interrupt Manager (Interrupt)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SYSTEM_INTERRUPT
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__interrupt__manager.html"/>
        <file category="header" name="platform/system/inc/fsl_interrupt_manager.h"/>
        <file category="source" name="platform/system/src/interrupt/fsl_interrupt_manager.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK System" Csub="HwTimer" Cvariant="Framework" Cversion="1.2.0" condition="Kinetis SYS_HwTimer">
      <description>Hardware Timer (HwTimer): Framework</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SYSTEM_HWTIMER
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__hwtimer__driver.html"/>
        <file category="header" name="platform/system/inc/fsl_hwtimer.h"/>
        <file category="source" name="platform/system/src/hwtimer/fsl_hwtimer.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK System" Csub="HwTimer" Cvariant="PIT" Cversion="1.2.0" condition="Kinetis SYS_HwTimer_PIT">
      <description>Hardware Timer (HwTimer): PIT</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SYSTEM_HWTIMER_PIT
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__hwtimer__driver.html"/>
        <file category="header" name="platform/system/inc/fsl_hwtimer.h"/>
        <file category="header" name="platform/system/inc/fsl_hwtimer_pit.h"/>
        <file category="source" name="platform/system/src/hwtimer/fsl_hwtimer.c"/>
        <file category="source" name="platform/system/src/hwtimer/fsl_hwtimer_pit.c"/>
        <file category="source" name="platform/system/src/hwtimer/fsl_hwtimer_pit_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK System" Csub="HwTimer" Cvariant="SysTick" Cversion="1.2.0" condition="Kinetis SYS_HwTimer_SysTick">
      <description>Hardware Timer (HwTimer): SysTick</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SYSTEM_HWTIMER_SYSTICK
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__hwtimer__driver.html"/>
        <file category="header" name="platform/system/inc/fsl_hwtimer.h"/>
        <file category="header" name="platform/system/inc/fsl_hwtimer_systick.h"/>
        <file category="source" name="platform/system/src/hwtimer/fsl_hwtimer.c"/>
        <file category="source" name="platform/system/src/hwtimer/fsl_hwtimer_systick.c"/>
        <file category="source" name="platform/system/src/hwtimer/fsl_hwtimer_systick_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK System" Csub="Power" Cversion="1.2.0" condition="Kinetis SYS_Power">
      <description>Power Manager (Power)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SYSTEM_POWER
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__power__manager.html"/>
        <file category="header" name="platform/system/inc/fsl_power_manager.h"/>
        <file category="source" name="platform/system/src/power/fsl_power_manager.c"/>
      </files>
    </component>

    <!-- KSDK OSA -->
    <component Cclass="Device" Cgroup="KSDK OSA" Csub="OSA" Cvariant="Bare Metal" Cversion="1.2.0" condition="Kinetis OSA_BM">
      <description>Bare Metal Abstraction Layer (no RTOS)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_OSA_BM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/Kinetis SDK v.1.2.0 API Reference Manual/group__os__abstraction__bm.html"/>
        <file category="header" name="platform/osa/inc/fsl_os_abstraction.h"/>
        <file category="source" name="platform/osa/src/fsl_os_abstraction_bm.c"/>
      </files>
    </component>

    <!-- KSDK Utility -->
    <component Cclass="Device" Cgroup="KSDK Utility" Csub="Debug Console" Cversion="1.2.0" condition="Kinetis_K64F12 Utility_DebugConsole">
      <description>Debug Console</description>
      <RTE_Components_h>
        #define RTE_DEVICE_UTILITY_DEBUG_CONSOLE
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/utilities/inc/fsl_debug_console.h"/>
        <file category="source" name="platform/utilities/src/fsl_debug_console.c"/>
        <file category="source" name="platform/utilities/src/print_scan.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="KSDK Utility" Csub="Misc" Cversion="1.2.0" condition="Kinetis Utility_Misc">
      <description>Miscellaneous Utilities</description>
      <RTE_Components_h>
        #define RTE_DEVICE_UTILITY_MISC
      </RTE_Components_h>
      <files>
        <file category="header" name="platform/utilities/inc/fsl_misc_utilities.h"/>
        <file category="source" name="platform/utilities/src/fsl_misc_utilities.c"/>
      </files>
    </component>

    <!-- CMSIS Driver -->
    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1" Cversion="1.3" condition="Kinetis_K64F CMSIS_Driver ETH_MAC">
      <description>Ethernet MAC Driver for K64F Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="addon_cmsis/Driver/MK64F/EMAC_MK64F.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2" Cversion="1.3" condition="Kinetis_K64F CMSIS_Driver I2C">
      <description>I2C Driver for K64F Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C0                /* Driver I2C0 */
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="addon_cmsis/Driver/MK64F/I2C_MK64F.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2" Cversion="1.2" condition="Kinetis_K64F CMSIS_Driver MCI">
      <description>MCI Driver for K64F Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="addon_cmsis/Driver/MK64F/MCI_MK64F.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.1"  Cversion="1.2" condition="Kinetis_K64F CMSIS_Driver SPI">
      <description>SPI Driver for K64F Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="addon_cmsis/Driver/MK64F/SPI_MK64F.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.1" Cversion="1.2" condition="Kinetis_K64F CMSIS_Driver USART">
      <description>USART Driver for K64F Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART0              /* Driver USART0 */
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        #define RTE_Drivers_USART5              /* Driver USART5 */
      </RTE_Components_h>
      <files>
        <file category="source" name="addon_cmsis/Driver/MK64F/UART_MK64F.c"/>
      </files>
    </component>
